Tekla.Structures.DrawingInternal.Tools.DrawingCreationEventUtility
Provides utility methods for handling drawing creation events.

Tekla.Structures.DrawingInternal.Tools.DrawingCreationEventUtility.ExportDrawingCreationParametersAsStringList(Tekla.Structures.DrawingInternal.grDrawingCreationSource_e,Tekla.Structures.DrawingInternal.QueryTypeEnum)
Exports the drawing creation parameters as a list of strings based on the specified operation type.
source:
The drawing creation source.
operationType:
The type of the operation to be performed.
Remarks:
If the operation type is Tekla.Structures.DrawingInternal.QueryTypeEnum.QUERY_INSERT or Tekla.Structures.DrawingInternal.QueryTypeEnum.AUTOMATION_RUN_AUTODRAWINGS, it exports a list of creation tracking parameters.

Tekla.Structures.DrawingInternal.Tools.DrawingCreationEventUtility.ExportDrawingCreationParametersAsIntList(Tekla.Structures.DrawingInternal.QueryTypeEnum,System.Nullable{Tekla.Structures.DrawingInternal.grDrawingCreationSource_e})
Exports the drawing creation parameters as a list of strings based on the specified operation type.
operationType: The type of the operation to be performed.
OverrideTrackingSource: If specified, use the passed parameter as tracking source.
Remarks:
If the operation type is Tekla.Structures.DrawingInternal.QueryTypeEnum.QUERY_INSERT or Tekla.Structures.DrawingInternal.QueryTypeEnum.AUTOMATION_RUN_AUTODRAWINGS, it exports a list of creation tracking parameters.